In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [5]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, 1543449657796, 73, 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (2, 1543449690796, 24, 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, 1543449841796, 24, 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, 1543449895796, 73, 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (5, 1543450033796, 24, 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [88]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(73, 'Jacob', 'Klein', 'M', 'paid'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (24, 'Layla', 'Griffin', 'F', 'paid')]

In [81]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOINLJW12A8C13314C', 'City Slickers', 'AR8IEZO1187B99055E', 2008, Decimal('149.86404')),
 ('SOGDBUF12A8C140FAA', 'Intro', 'AR558FS1187FB45658', 2003, Decimal('75.67628')),
 ('SORRZGD12A6310DBC3', 'Harajuku Girls', 'ARVBRGZ1187FB4675A', 2004, Decimal('290.55955')),
 ('SONWXQJ12A8C134D94', 'The Ballad Of Sleeping Beauty', 'ARNF6401187FB57032', 1994, Decimal('305.162')),
 ('SOFCHDR12AB01866EF', 'Living Hell', 'AREVWGE1187B9B890A', 0, Decimal('282.43546'))]

In [8]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR8IEZO1187B99055E', 'Marc Shaiman', '', Decimal('NaN'), Decimal('NaN')),
 ('AR558FS1187FB45658', '40 Grit', '', Decimal('NaN'), Decimal('NaN')),
 ('ARVBRGZ1187FB4675A', 'Gwen Stefani', '', Decimal('NaN'), Decimal('NaN')),
 ('ARNF6401187FB57032', 'Sophie B. Hawkins', 'New York, NY [Manhattan]', Decimal('40.79086'), Decimal('-73.96644')),
 ('AREVWGE1187B9B890A', 'Bitter End', 'Noci (BA)', Decimal('-13.442'), Decimal('-41.9952'))]

In [56]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1543449657796, 0, 1, 1, 1, 1970, 3),
 (1543449690796, 0, 1, 1, 1, 1970, 3),
 (1543449841796, 0, 1, 1, 1, 1970, 3),
 (1543449895796, 0, 1, 1, 1, 1970, 3),
 (1543450033796, 0, 1, 1, 1, 1970, 3)]

# Exploratory Data Analysis

## Top 10 locations with highest users

In [96]:
%sql SELECT location, count(*) FROM songplays GROUP BY location ORDER BY count(*) DESC LIMIT 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('San Francisco-Oakland-Hayward, CA', 691),
 ('Portland-South Portland, ME', 665),
 ('Lansing-East Lansing, MI', 557),
 ('Chicago-Naperville-Elgin, IL-IN-WI', 475),
 ('Atlanta-Sandy Springs-Roswell, GA', 456),
 ('Waterloo-Cedar Falls, IA', 397),
 ('Lake Havasu City-Kingman, AZ', 321),
 ('Tampa-St. Petersburg-Clearwater, FL', 307),
 ('San Jose-Sunnyvale-Santa Clara, CA', 292),
 ('Sacramento--Roseville--Arden-Arcade, CA', 270)]

## Access by platform

In [97]:
%sql SELECT SPLIT_PART(SPLIT_PART(SPLIT_PART(user_agent,'(', 2),';',1),')',1) AS platforms, count(*) FROM songplays GROUP BY platforms;

 * postgresql://student:***@127.0.0.1/sparkifydb
8 rows affected.

[('Windows NT 6.1', 884),
 ('Windows NT 5.1', 955),
 ('iPhone', 239),
 ('X11', 1153),
 ('compatible', 11),
 ('Windows NT 6.3', 576),
 ('Windows NT 6.2', 2),
 ('Macintosh', 3000)]

## Total minutes for all albums by each artist (Top 10)

In [52]:
%sql SELECT SPLIT_PART(name,';',1) AS artist, ROUND(SUM(duration),0) AS total_album_minutes FROM songs INNER JOIN artists USING (artist_id) GROUP BY name ORDER BY total_album_minutes DESC LIMIT 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('Clp', Decimal('1209')),
 ('Casual', Decimal('957')),
 ('Faiz Ali Faiz', Decimal('599')),
 ('Montserrat Caballé', Decimal('511')),
 ('Blue Rodeo', Decimal('491')),
 ('John Wesley', Decimal('485')),
 ('Trafik', Decimal('424')),
 ('Jinx', Decimal('407')),
 ('Steve Morse', Decimal('364')),
 ('Terry Callier', Decimal('343'))]

## Access by Week

In [57]:
%sql SELECT week, count(*) FROM time GROUP BY week LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(1, 6820)]

## Type(Level) of user

In [61]:
%sql SELECT level, count(level) FROM songplays GROUP BY level LIMIT 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('free', 1229), ('paid', 5591)]

## Highest listened user by location

In [98]:
%sql SELECT songplays.location, name, count(*) AS counts FROM songplays INNER JOIN artists USING (artist_id) GROUP BY songplays.location, name ORDER BY counts DESC LIMIT 10 ;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('San Francisco-Oakland-Hayward, CA', 'Marc Shaiman', 691),
 ('Portland-South Portland, ME', 'Marc Shaiman', 665),
 ('Lansing-East Lansing, MI', 'Marc Shaiman', 557),
 ('Chicago-Naperville-Elgin, IL-IN-WI', 'Marc Shaiman', 475),
 ('Atlanta-Sandy Springs-Roswell, GA', 'Marc Shaiman', 456),
 ('Waterloo-Cedar Falls, IA', 'Marc Shaiman', 397),
 ('Lake Havasu City-Kingman, AZ', 'Marc Shaiman', 321),
 ('Tampa-St. Petersburg-Clearwater, FL', 'Marc Shaiman', 307),
 ('San Jose-Sunnyvale-Santa Clara, CA', 'Marc Shaiman', 292),
 ('Sacramento--Roseville--Arden-Arcade, CA', 'Marc Shaiman', 270)]

In [99]:
%sql SELECT location, artist_name FROM (SELECT songplays.location AS location, name AS artist_name, count(*) over(PARTITION BY songplays.location) AS counts, dense_rank() over(PARTITION BY songplays.location) AS rank FROM songplays INNER JOIN artists USING(artist_id) GROUP BY 1, 2) AS stats WHERE stats.rank =1 LIMIT 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('Atlanta-Sandy Springs-Roswell, GA', 'Marc Shaiman'),
 ('Augusta-Richmond County, GA-SC', 'Marc Shaiman'),
 ('Birmingham-Hoover, AL', 'Marc Shaiman'),
 ('Cedar Rapids, IA', 'Marc Shaiman'),
 ('Chicago-Naperville-Elgin, IL-IN-WI', 'Marc Shaiman'),
 ('Columbia, SC', 'Marc Shaiman'),
 ('Dallas-Fort Worth-Arlington, TX', 'Marc Shaiman'),
 ('Detroit-Warren-Dearborn, MI', 'Marc Shaiman'),
 ('Elkhart-Goshen, IN', 'Marc Shaiman'),
 ('Eugene, OR', 'Marc Shaiman')]

## Average album length over years

In [95]:
%sql SELECT year, round(sum(duration)/count(year),2) AS average_album_length FROM songs GROUP BY year ORDER BY year;

 * postgresql://student:***@127.0.0.1/sparkifydb
21 rows affected.

[(0, Decimal('245.57')),
 (1961, Decimal('156.39')),
 (1964, Decimal('164.81')),
 (1969, Decimal('148.04')),
 (1972, Decimal('342.57')),
 (1982, Decimal('233.40')),
 (1984, Decimal('269.82')),
 (1985, Decimal('124.86')),
 (1986, Decimal('307.38')),
 (1987, Decimal('491.13')),
 (1992, Decimal('133.33')),
 (1993, Decimal('270.60')),
 (1994, Decimal('270.67')),
 (1997, Decimal('240.69')),
 (1999, Decimal('236.25')),
 (2000, Decimal('203.61')),
 (2003, Decimal('136.44')),
 (2004, Decimal('249.02')),
 (2005, Decimal('262.09')),
 (2007, Decimal('209.61')),
 (2008, Decimal('149.86'))]